docs/news/20200214.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Feb 14, 2020</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Feb 14, 2020</h1>
</header><p>
<b><b>IMPORTANT!</b></b> Carbs-init update to be released on 17th of February
will require manual intervention. I am holding this update back so
people can see it before they update their system (even though the
update will show the same message as this). The rationale for the
update is explained below the intervention.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">There is an explanation for each init You only need to follow the instructions</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">for your own init-system</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">busybox-init</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If you did not edit your inittab simply move inittab.new to inittab</span>
mv /etc/inittab.new /etc/inittab

<span class="org-comment-delimiter"># </span><span class="org-comment">If you did edit your inittab you can use a simple sed command to remove the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">necessary lines</span>
sed -i <span class="org-string">'/getty/d;/runsvdir/d'</span> /etc/inittab


<span class="org-comment-delimiter">## </span><span class="org-comment">runit</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">same as busybox-init, if you did not edit /etc/runit/2 move 2.new to 2</span>
mv /etc/runit/2.new /etc/runit/2

<span class="org-comment-delimiter"># </span><span class="org-comment">else</span>
vim /etc/runit/2
<span class="org-comment-delimiter"># </span><span class="org-comment">open your 2 file and remove the for loop containing getty commands. If you are</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">using runit, it is recommended to comment out /etc/init/runit.boot</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">sinit/minit</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If you did not edit your {sinit-,}launch-services.boot you can simply remove</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">it.</span>
rm -f /etc/init/launch-services.boot /etc/init/sinit-launch-services.boot

<span class="org-comment-delimiter"># </span><span class="org-comment">This should leave you without any issues, and you can safely reboot.</span>
</pre>
</div>

<p>
Carbs-init update is to make sure init systems do not clash, and do
not have to use different files. This is a sensible update both for
the user user and for the maintainer side. 
</p>

<p>
To give an example, before this update busybox-init was managing getty
through <code>inittab</code>, runit was managing through <code>/etc/runit/2</code>, and
minit/sinit were launching from <code>/etc/init/launch-services.boot</code>. This
is a configuration nightmare for everyone, and since I am maintaining
and constantly testing those init providers, a huge nightmare for me. 
This is a Quality of Life update.
</p>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
